PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	float base = _base_interval[channel_index];

	for (unsigned i = 0; i < interval_count; i++) {
		// Convert interval to bit count using relative threshold
		// Round to nearest: 0.5-1.5 → 1, 1.5-2.5 → 2, 2.5-3.5 → 3, etc.
		float interval_f = (float)intervals[i];
		uint32_t bits = (uint32_t)((interval_f / base) + 0.5f);

		// Clamp to valid range (1-4 bits typical in GCR encoding)
		if (bits < 1) {
			bits = 1;

		} else if (bits > 4) {
			bits = 4;
		}

		// Shift in the bits
		for (unsigned bit = 0; bit < bits; ++bit) {
			value = (value << 1) | high;
			++shifted;
		}

		high = !high;
	}

	// Flexible frame validation: accept 18-24 bits instead of forcing exactly 21
	// This handles ESC timing variation and incomplete frames
	if (shifted < 18 || shifted > 24) {
		// Frame too short or too long - likely corrupted
		return 0;
	}

	// Pad to 21 bits for GCR decoder (which expects exactly 21 bits)
	if (shifted < 21) {
		value <<= (21 - shifted);

	} else if (shifted > 21) {
		// Trim excess bits (shouldn't happen often with proper decoding)
		value >>= (shifted - 21);
	}

	return value;
}

void decode_dshot_telemetry(uint32_t payload, struct BDShotTelemetry *packet)
{
	// Extended DShot Telemetry
	bool edt_enabled = _extended_dshot_telem;
	uint32_t mantissa = payload & 0x01FF;
	bool is_telemetry = (mantissa & 0x0100) ==
			    0; // if the msb of the mantissa is zero, then this is an extended telemetry packet

	if (edt_enabled && is_telemetry) {
		packet->type = (payload & 0x0F00) >> 8;
		packet->value = payload & 0x00FF; // extended telemetry value is 8 bits wide

	} else {
		// otherwise it's an eRPM frame
		uint8_t exponent = ((payload >> 9) & 0x7); // 3 bit: exponent
		uint16_t period = (payload & 0x1FF); // 9 bit: period base
		period = period << exponent; // Period in usec

		packet->type = DSHOT_EDT_ERPM;

		if (period == 65408) {
			// Special case for zero motion (e.g., stationary motor)
			packet->value = 0;

		} else {
			packet->value = (1000000 * 60 / 100 + period / 2) / period;
		}
	}
}

// bits  1-11    - throttle value (0-47 are reserved for commands, 48-2047 give 2000 steps of throttle resolution)
// bit   12      - dshot telemetry enable/disable
// bits  13-16   - XOR checksum
void dshot_motor_data_set(unsigned channel, uint16_t data, bool telemetry)
{
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	if (!channel_initialized) {
		return;
	}

	uint16_t packet = 0;
	uint16_t checksum = 0;

	packet |= data << DSHOT_THROTTLE_POSITION;
	packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

	uint16_t csum_data = packet;

	// XOR checksum calculation
	csum_data >>= NIBBLES_SIZE;

	for (uint8_t i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
		checksum ^= (csum_data & 0x0F); // XOR data by nibbles
		csum_data >>= NIBBLES_SIZE;
	}

	if (_bdshot_enabled) {
		packet |= ((~checksum) & 0x0F);

	} else {
		packet |= ((checksum) & 0x0F);
	}

	const io_timers_channel_mapping_element_t *mapping = &io_timers_channel_mapping.element[timer_index];
	uint8_t num_motors = mapping->channel_count_including_gaps;
	uint8_t timer_channel = timer_io_channels[channel].timer_channel - mapping->lowest_timer_channel;

	for (uint8_t motor_data_index = 0; motor_data_index < ONE_MOTOR_DATA_SIZE; motor_data_index++) {
		dshot_output_buffer[timer_index][motor_data_index * num_motors + timer_channel] =
			(packet & 0x8000) ? MOTOR_PWM_BIT_1 : MOTOR_PWM_BIT_0;  // MSB first
		packet <<= 1;
	}
}

int up_dshot_arm(bool armed)
{
	return io_timer_set_enable(armed, _bdshot_enabled ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot,
				   IO_TIMER_ALL_MODES_CHANNELS);
}

int up_bdshot_num_channels_ready(void)
{
	int num_ready = 0;

	for (unsigned i = 0; i < MAX_TIMER_IO_CHANNELS; ++i) {
		if (_bdshot_processed[i]) {
			++num_ready;
		}
	}

	return num_ready;
}

int up_bdshot_num_errors(uint8_t channel)
{
	return read_fail_crc[channel];
}

int up_bdshot_get_erpm(uint8_t channel, int *erpm)
{
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	int status = PX4_ERROR;

	if (channel_initialized && _erpms[channel].ready) {
		*erpm = _erpms[channel].erpm;
		status = PX4_OK;
	}

	// Mark sample read
	_bdshot_processed[channel] = false;

	return status;
}

int up_bdshot_get_extended_telemetry(uint8_t channel, int type, uint8_t *value)
{
	int result = PX4_ERROR;

	switch (type) {
	case DSHOT_EDT_TEMPERATURE:
		if (_edt_temp[channel].ready) {
			*value = _edt_temp[channel].value;
			_edt_temp[channel].ready = false;
			result = PX4_OK;
		}

		break;

	case DSHOT_EDT_VOLTAGE:
		if (_edt_volt[channel].ready) {
			*value = _edt_volt[channel].value;
			_edt_volt[channel].ready = false;
			result = PX4_OK;
		}

		break;

	case DSHOT_EDT_CURRENT:
		if (_edt_curr[channel].ready) {
			*value = _edt_curr[channel].value;
			_edt_curr[channel].ready = false;
			result = PX4_OK;
		}

		break;

	default:
		break;
	}

	return result;
}

int up_bdshot_get_extended_telemetry_rate(uint8_t channel, int type, int *value)
{
	int result = PX4_ERROR;

	switch (type) {
	case DSHOT_EDT_TEMPERATURE:
		if (_bdshot_online[channel]) {
			*value = 0;
			result = PX4_OK;
		}

		break;

	case DSHOT_EDT_VOLTAGE:
		if (_bdshot_online[channel]) {
			*value = 0;
			result = PX4_OK;
		}

		break;

	case DSHOT_EDT_CURRENT:
		if (_bdshot_online[channel]) {
			*value = 0;
			result = PX4_OK;
		}

		break;

	default:
		break;
	}

	return result;
}

int up_bdshot_channel_online(uint8_t channel)
{
	if (channel >= MAX_TIMER_IO_CHANNELS) {
		return 0;
	}

	return _bdshot_online[channel];
}

void up_bdshot_status(void)
{
	PX4_INFO("dshot driver stats:");

	if (_bdshot_enabled) {
		PX4_INFO("BDShot enabled");
	}

	if (_extended_dshot_telem) {
		PX4_INFO("BDShot EDT rates");

		for (int i = 0; i < MAX_TIMER_IO_CHANNELS; i++) {

			if (_bdshot_online[i]) {
				PX4_INFO("Ch%d:  eRPM: %dHz  Temp: %.2fHz  Volt: %.2fHz  Curr: %.2fHz",
					 i,
					 (int)_erpms[i].rate_hz,
					 (double)_edt_temp[i].rate_hz,
					 (double)_edt_volt[i].rate_hz,
					 (double)_edt_curr[i].rate_hz);
			}
		}
	}

	uint8_t timer_index = _bidi_timer_index;

	for (uint8_t timer_channel_index = 0; timer_channel_index < MAX_NUM_CHANNELS_PER_TIMER; timer_channel_index++) {
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

		if (channel_initialized) {
			PX4_INFO("Timer %u, Channel %u: read %lu, failed CRC %lu",
				 timer_index, timer_channel_index,
				 read_ok[timer_channel_index],
				 read_fail_crc[timer_channel_index]);
		}
	}
}

#endif
